<template>
	<section class="section">
		<h1 class="section__title">Новости сайта</h1>
		<div class="section__body">
			<div :class="'news-block' + (item.isClassAdded ? ' active' : '')" v-for="(item, index) in items" :key="index" @click="addOrRemoveClass(index)">
				<div class="news-block__content">
					<p class="news-block__date">22.12.2023 (20:20 МСК)</p>
					<h3 class="news-block__title">Банк России встревожен большими тратами россиян</h3>
					<p class="news-block__text">
						Банк России выразил обеспокоенность по поводу больших трат россиян. В связи с этим принято решение снизить макропруденциальные лимиты.
						<br />
						В конце августа регулятор впервые установил ограничения на выдачу кредитов россиянам с повышенной долговой нагрузкой. Подобный шаг вводился для снижения ажиотажа вокруг ипотеки. Более жесткая политика позволила к октябрю замедлить рост задолженности по потребительским займам из категории необеспеченных. Если раньше в портфелях банков на них приходилось 34%, то теперь – всего 31%. Уже в следующем году ЦБ намерен довести показатель до 20%.
						<br />
						Эльвира Набиуллина обеспокоена, что большая часть кредитов предоставляется лицам, тратящим на них более 50% дохода. Данную тенденцию требуется ограничить. Сделать это можно только путем введения лимитов. Глава регулятора призвала продолжить ужесточать лимиты. Сейчас в зоне риска находятся займы с ПДН 70+, поэтому нужно вводить ограничения для данной группы заемщиков.
						<br />
						Большинство кредитов идет на дорогостоящие покупки. За год их количество в общем объеме достигло 30,6%. Наубиллина считает, что от этой модели нужно отходить. Вместо трат граждане должны начать заниматься накоплениями.
					</p>
				</div>
				<div class="news-block__image" style="background-image: url(/src/assets/news.png)"></div>
			</div>
		</div>
	</section>
</template>

<script setup>
import { reactive } from 'vue'

const items = Array(3)
	.fill()
	.map(() => reactive({ isClassAdded: false }))

const addOrRemoveClass = index => {
	items[index].isClassAdded = !items[index].isClassAdded
}
</script>
